{
  "app.about.change-theme": "Change Theme",
  "app.about.my-projects": "My Projects",
  "app.about.medium-stories": "Medium Stories",
  "app.about.short-desc": "Fullstack developer at Dfind Consulting, tech. blogger & web development enthusiast",
  "app.about.check-blogs": "or check out",
  "app.about-about-me": "About Me",
  "app.about.contact": "Contact Me",
  "app.about.what-i-do.user-interface.description": "By creating a clear user interface, where the page enables people to interact with the system by communicating meaning and function.",
  "app.about.what-i-do.development.description": "I'm a fullstack developer who loves being a part of the whole development-process.",
  "app.about.what-i-do.communication.description": "I value communication and think it's important to get a clear understanding of the customers product, to create good solutions.",
  "app.about.what-i-do.security.description": "Security is an essential part of any application. We need to protect our users from threat actors, interested in ",
  "app.story.folder-structure.long": "How to define a highly scalable folder structure for your Angular project",
  "app.story.folder-structure.short": "Angular Architecture",
  "app.story.folder-structure.desc": "Finding a suitable folder structure for my Angular applications is something I’ve struggled with for a long time. This became a real issue in my first ever real-world Angular project — especially when the application grew in size. I ended up continuously adding new features with no real structure in place.",
  "app.story.clean-code.short": "Clean Code Checklist in Angular",
  "app.story.clean-code.long": "Clean Code Checklist in Angular",
  "app.story.clean-code.desc": "Angular has rapidly grown to become one of the most popular frameworks for building front-end, cross-platform web applications. It gives you a lot of the out-of-the-box features, such as a routing system, a dependency injection framework, forms handling, etc.",
  "app.story.modal-forms.short": "Modular Forms With ng-bootstrap",
  "app.story.modal-forms.long": "Creating Forms inside modals with ng-bootstrap",
  "app.story.modal-forms.desc": "Creating forms inside modals has some great benefits. Using them along with valuable content might bring a lot of attraction to your project. With the emergence of ngx- and ng-bootstrap, we can easily integrate any Bootstrap components to our application.",
  "app.story.ngx-rocket.short": "Using NGX-Rocket",
  "app.story.ngx-rocket.long": "Using NGX-Rocket",
  "app.story.ngx-rocket.desc": "In this article, we will dive deep into a new Angular generator called ngX-Rocket. ngX-Rocket is an Angular 5+ enterprise project-generator based on the Angular-CLI with best practices from the community.",
  "app.story.how-to-read-code.long": "How To Read Code?",
  "app.story.how-to-read-code.short": "How To Read Code?",
  "app.story.how-to-read-code.desc": "When approaching a new and unfamiliar codebase, which techniques would get you up and running as quickly as possible? This article teaches you my personal recommendations for approaching an unfamiliar codebase.",
  "app.story.nordicjs-review.short": "NordicJS - A Personal Review",
  "app.story.choosing-the-right-structure-in-2020.short": "Choosing Right Angular Structure in 2020",
  "app.story.build-pattern-in-node.short": "Complex Construction With Builder Pattern in Node",
  "app.about.get-notified.follow": "Follow",
  "app.about.code-msg1": "Hi!",
  "app.about.code-msg2": "My name is Mathis Garberg, and I work as a fullstack developer at Dfind Consulting.",
  "app.about.code-msg3": "This site will hopefully give you some insight about me.",
  "app.about.p1": "Mathis started as web developer for Telenor in 2017, and has through experience in both work and education, worked up a strong professional experience in a range of web-, design- and security related subjects. His a team player, structured in his work and has is good at solving complex problems. His has a passion for development, and spend a lot of time developing his skill set in the entire development process. This contributes to that his solutions is up to date, user friendly and secure. Mathis does is also engaged in open source development, and has written several articles on Medium.",
  "app.about.view-resume": "View resumé",
  "app.about.view-profile": "View profile",
  "app.about.cv-link-text": "here",
  "app.features.documentation": "Docs",
  "app.features.guide": "Guide",
  "app.features.themes.description": "Flexible theming support for provided and custom components",
  "app.features.themes.title": "Themes",
  "app.features.title": "Features",
  "app.features.typescript": "Superior developer experience, code completion, refactoring and less bugs",
  "app.footer.changelog": "Show changelog",
  "app.header.github": "Project Github Repository",
  "app.menu.about": "About",
  "app.menu.projects": "Projects",
  "app.menu.stories": "Medium Stories",
  "app.menu.contact": "Contact",
  "app.menu.settings": "Settings",
  "app.menu.admin": "Admin Panel",
  "app.projects.categories.title": "Categories",
  "app.projects.categories.games": "Games",
  "app.projects.categories.web-development": "Web development",
  "app.settings.animations.elements": "Navigation page elements slide up",
  "app.settings.animations.page": "Navigation whole page transition",
  "app.settings.animations.title": "Animations",
  "app.settings.general.language.no": "Norwegian",
  "app.settings.general.language.en": "English",
  "app.settings.particle.SnowParticle": "Snow",
  "app.settings.particle.ConfettiParticle": "Confetti",
  "app.settings.particle.RainParticle": "Rain",
  "app.settings.particle.BinaryParticle": "Binary",
  "app.settings.particle.StarParticle": "Star",
  "app.settings.particle.placeholder": "Particle",
  "app.settings.general.placeholder": "Language",
  "app.settings.general.title": "General",
  "app.settings.themes.blue": "Blue",
  "app.settings.themes.dark": "Dark",
  "app.settings.themes.light": "Light",
  "app.settings.themes.nature": "Nature",
  "app.settings.themes.hacker": "Hacker",
  "app.settings.themes.night-mode": "Auto night mode (from 21:00 to 7:00)",
  "app.settings.themes.os-mode": "Theme based on operating system mode",
  "app.settings.themes.placeholder": "Color Theme",
  "app.settings.themes.saneago": "",
  "app.settings.themes.sticky-header": "Sticky header",
  "app.settings.themes.title": "Themes",
  "app.settings.title": "Settings",
  "app.contact.subject": "Subject",
  "app.contact.description": "Description",
  "app.contact.subject.error.required": "Subject is required",
  "app.contact.subject.error.valid": "Subject should be valid",
  "app.contact.description.error.required": "Description is required",
  "app.reset-form": "Reset",
  "app.title.long": "Mathis",
  "app.title.short": "Mathis Web Portfolio",
  "app.user-interface": "User interface",
  "app.development": "Development",
  "app.communication": "Communication",
  "app.security": "Security",
  "app.what-i-do": "What i do",
  "app.show-all": "Show all",
  "app.hide": "Hide",
  "app.highlighted-projects": "Highlighted projects",
  "app.read-more": "Read more",
  "app.coming-soon": "N/A",
  "app.unavailable-for-hire": "Unavailable for hire",
  "app.about-the-project": "About the project",
  "app.technical-sheet": "Technical Experience",
  "app.project-details.angular-folder-structure.title": "Angular folder structure",
  "app.project-details.angular-folder-structure.section-1": "Since one of my medium articles got a lot of traction, and a lot of people started to ask about the source code, I put together this project.",
  "app.project-details.mathis-website.title": "Mathis website",
  "app.project-details.city-walk-in-gjoevik": "City walk in Gjoevik",
  "app.project-details.city-walk-in-gjoevik.section-1": "«City Walk in Gjoevik» is an application developed to gain information about the different landmarks in the Gjoevik-refionen trhough healt-associated activites.",
  "app.project-details.city-walk-in-gjoevik.section-2": "Together with two other students at NTNU in Gjøvik, Mathis developed a hybrid application in the Ionic framework. The application contains informations about their location, detailed information about every object and the ability to mark visited locations inside a certain radius.",
  "app.project-details.city-walk-in-gjoevik.section-3": "Mathis worked as a fullstack developer with technologies such as Firebase (back-end) and Ionic (front-end).",
  "app.project-details.noc-dashboard.section-1": "Mathis has since 2018-19 been developing an internal system for operation and monitoring in Telenor. The system is critical and includes EKOM-sensitive information, and can't be described in detail.",
  "app.project-details.noc-dashboard.section-2": "NOC Dashboard contains a servicecatalouge, tied up to alarms and error, and gives a status on all Telenor systems in real-time. The system handles multiple different value chains og presents multiple interfaces for all these. The system does also contain a dashboard, which displays statuses on net- and services, and advances analyzes, tied up to Telenors KPI's.",
  "app.project-details.noc-dashboard.section-3": "Mathis has through his work on NOC Dashboard developed a very advanced interface with administration possibilities for Telenors services. His been responsible for the front-end development and has through this process also developed an agile and effect working methodology, written maintainable and up-to-date code and improved Telenors ability to develop better API's.",
  "app.project-details.claims-web.section-1": "ClaimsWeb is a case processing and documentation system that is used for invoicing repair work against the offender who has destroyed Telenor's infrastructure. The system is a critical part of Telenor's error correction process, and cases are billed for tens of millions a year.",
  "app.project-details.claims-web.section-2": "The project Mathis has been a part of has contributed insight into the error correction process in Telenor, evaluation of existing solution, advice on changes of platform and implementation of a new solution. The work on the solution includes database architecture, exposure of information through API endpoints and development of a front end application for the consumption and presentation of this information.",
  "app.project-details.claims-web.section-3": "Mathis has worked as a full-time developer and been at technologies like .NET Core and Angular. He has, among other things, developed a dynamic data table with a number of configuration options that reduce the time case officers need to find a current case. In addition, he has developed several functions in the interface for processing, documenting and following up various issues. Throughout the project, Mathis has worked closely with the project owner to ensure that the solution satisfies the requirements set for the project in the best possible way.",
  "app.auth.login.username": "Username",
  "app.auth.login.password": "Password"
}
