{
  "app.about.change-theme": "Endre Fargetema",
  "app.about.my-projects": "Mine Prosjekter",
  "app.about.medium-stories": "Medium Artikler",
  "app.about.short-desc": "Fullstack utvikler hos Dfind Consulting & utviklings entusiast",
  "app.about.check-blogs": "eller sjekk ut",
  "app.about-about-me": "Om Meg",
  "app.about.contact": "Kontakt Meg",
  "app.about.what-i-do.user-interface.description": "Ved å lage et gjennomført brukergrensesnitt, hvor siden tillater oss å interagere med systemet ved å kommunisere mening og funksjon",
  "app.about.what-i-do.development.description": "Jeg er en fullstack utvikler som liker å ta del i hele utviklingsprosessen.",
  "app.about.what-i-do.communication.description": "Jeg verdsetter kommunikasjon og synes det er viktig å få en god forståelse for kundens product for å lage gode, tilpassede løsninger.",
  "app.about.what-i-do.security.description": "",
  "app.story.folder-structure.long": "Hvordan definere en høyst skalelbar struktur for dine Angular prosjekter",
  "app.story.folder-structure.short": "Angular Filstruktur",
  "app.story.folder-structure.desc": "Det å finne en god filstruktur for mine Angular prosjekter er noe jeg slitt med lenge. Dette førte til store problemer når jeg opprettet min aller første enterprise applikasjon - spesielt når applikasjonen økte i størrelse. Jeg endte opp med å legge til ny funksjonalitet uten en ordentlig struktur på plass.",
  "app.story.clean-code.short": "Vedlikeholdbar Kode i Angular",
  "app.story.clean-code.long": "Sjekkliste for vedlikeholdbar kode i Angular",
  "app.story.clean-code.desc": "Angular har raskt økt til å bli en av de mest populære rammeverkene for å bygge front-end, krossplattform web-applikasjoner. Det gir deg en rekke ut-av-boksen funksjonalitet, som et routing system, et depndency injection rammeverk, skjema-håndtering, etc...",
  "app.story.modal-forms.short": "Skjemaer Inne i Modaler med ng-bootstrap",
  "app.story.modal-forms.long": "Opprette Skjemaer Inne i Modaler meg ng-bootstrap",
  "app.story.modal-forms.desc": "Oppretting av skjermaer inne i modaler har noen klare fordeler. Bruk av dem ved siden av meningsfylt innhold kan bringe stor oppmerksomhet til prosjektene dine. Med inntoget av ngx-bootstrap, kan du enkelt integrere denne funksjonaliteten i dine web-applikasjoner.",
  "app.story.ngx-rocket.short": "Opprett Enterprise Løsninger Med ngX-Rocket",
  "app.story.ngx-rocket.long": "Opprett Enterprise Løsninger Med ngX-Rocket",
  "app.story.ngx-rocket.desc": "I denne artikkelen vil vi dykke inn i en new Angular generator ved navn ngX-Rocket. ngX-Rocket er en Angular 5+ enterprise prosjekt-generator, basert på Angular CLI med best practises fra Angular-miljøet.",
  "app.story.how-to-read-code.long": "Hvordan Lese Kode?",
  "app.story.how-to-read-code.short": "Hvordan Lese Kode?",
  "app.story.how-to-read-code.desc": "Når du møter en fremmed og ny kodebase, hvilke teknikker tar du i bruk for å komme fort i gang? Denne artikkelen beskriver mine personlige teknikker for å komme fort i gang.",
  "app.story.nordicjs-review.short": "NordicJS - En Personlig Anmeldelse",
  "app.story.choosing-the-right-structure-in-2020.short": "Velge den riktige filstrukturen for Angular applikasjoner i 2020 og utover",
  "app.story.build-pattern-in-node.short": "Complex Construction With Builder Pattern in Node",
  "app.about.get-notified.follow": "Følg",
  "app.about.code-msg1": "Hei!",
  "app.about.code-msg2": "Navnet mitt er Mathis Garberg, og jeg jobber som fullstack utvikler for Dfind.",
  "app.about.code-msg3": "Denne siden vil forhåpentligvis fortelle deg mer om meg.",
  "app.about.p1": "Mathis startet som webutvikler for Telenor høsten 2017, og har gjennom jobb og utdanning opparbeidet seg en sterk faglig kompetanse innen en rekke web-, design- og sikkerhetsrelaterte fag. Han er god til å samarbeide, svært strukturert i sitt arbeid og god til å finne løsninger på kompliserte problemer. Han brenner for utvikling og bruker mye av tiden sin på å utvikle ferdighetene sine innen hele utviklingsløpet. Dette bidrar til at løsningene han utvikler er oppdaterte, brukervennlige, robuste og sikre. Mathis er også sterkt engasjert i open source utvikling og har skrevet en rekke fagartikler på publiseringsplattformen Medium.",
  "app.about.p2": "",
  "app.about.view-resume": "Vis resumé",
  "app.about.view-profile": "Vis profil",
  "app.about.cv-link-text": "her",
  "app.features.documentation": "Dokumentasjon",
  "app.features.guide": "Guide",
  "app.features.themes.description": "Flexible theming support for provided and custom components",
  "app.features.themes.title": "Fargetema",
  "app.features.title": "Funksjonalitet",
  "app.features.typescript": "Superior developer experience, code completion, refactoring and less bugs",
  "app.footer.changelog": "Vis endringslogg",
  "app.header.github": "Project Github Repository",
  "app.menu.about": "Om",
  "app.menu.projects": "Prosjekter",
  "app.menu.stories": "Medium Artikler",
  "app.menu.contact": "Kontakt",
  "app.menu.settings": "Innstillinger",
  "appp.menu.admin": "Admin Panel",
  "app.projects.categories.title": "Kategorier",
  "app.projects.categories.games": "Spill",
  "app.projects.categories.web-development": "Webutvikling",
  "app.settings.animations.elements": "Navigasjonselementene sklir opp",
  "app.settings.animations.page": "Animasjon ved sidenavigering",
  "app.settings.animations.title": "Animasjoner",
  "app.settings.general.language.no": "Norsk",
  "app.settings.general.language.en": "Engelsk",
  "app.settings.particle.SnowParticle": "Snø",
  "app.settings.particle.ConfettiParticle": "Konfetti",
  "app.settings.particle.Rainparticle": "Regn",
  "app.settings.particle.BinaryParticle": "Binært",
  "app.settings.particle.StarParticle": "Stjerne",
  "app.settings.particle.placeholder": "Partikkel",
  "app.settings.general.placeholder": "Språk",
  "app.settings.general.title": "Generelt",
  "app.settings.themes.blue": "Blå",
  "app.settings.themes.dark": "Mørkt",
  "app.settings.themes.light": "Lyst",
  "app.settings.themes.nature": "Natur",
  "app.settings.themes.hacker": "Hacker",
  "app.settings.themes.night-mode": "Nattmodus (fra 21:00 til 7:00)",
  "app.settings.themes.os-mode": "Tema etter operativsystem-modus",
  "app.settings.themes.placeholder": "Fargetema",
  "app.settings.themes.saneago": "",
  "app.settings.themes.sticky-header": "Låst header",
  "app.settings.themes.title": "Fargetema",
  "app.settings.title": "Innstillinger",
  "app.contact.subject": "Emne",
  "app.contact.description": "Beskrivelse",
  "app.contact.subject.error.required": "Emne er obligatorisk",
  "app.contact.subject.error.valid": "Emnefeltet skal være valid",
  "app.contact.description.error.required": "Beskrivelse er obligatorisk",
  "app.reset-form": "Tilbakestill",
  "app.title.long": "Mathis",
  "app.title.short": "Mathis Web Portfolio",
  "app.user-interface": "Brukergrensesnitt",
  "app.development": "Utvikling",
  "app.communication": "Kommunikasjon",
  "app.security": "Sikkerhet",
  "app.what-i-do": "Hva jeg gjør",
  "app.show-all": "Vis alle",
  "app.hide": "Gjem",
  "app.highlighted-projects": "Fremhevede prosjekter",
  "app.read-more": "Les mer",
  "app.coming-soon": "Kommer snart",
  "app.unavailable-for-hire": "Utilgjengelig for leie",
  "app.about-the-project": "Om prosjektet",
  "app.technical-sheet": "Teknologier",
  "app.project-details.angular-folder-structure.title": "Angular filstruktur",
  "app.project-details.angular-folder-structure.section-1": "Siden en av artiklene mine fikk mye oppmerksomhet, og mange personer begynte å spørre etter kildekoden, opprettet jeg dette prosjektet.",
  "app.project-details.mathis-website.title": "Mathis nettside",
  "app.project-details.city-walk-in-gjoevik": "Byvandring i Gjøvik",
  "app.project-details.city-walk-in-gjoevik.section-1": "«Byvandring i Gjøvik» er en applikasjon som ble utviklet for å skape interesse rundt de ulike landemerkene i Gjøvik-regionen gjennom helsefremmende aktiviteter.",
  "app.project-details.city-walk-in-gjoevik.section-2": "Sammen med to andre studenter ved NTNU i Gjøvik var Mathis med å utvikle en hybrid applikasjon i rammeverket Ionic. Applikasjonen inneholder informasjon om hvor landemerkene fysisk befinner seg, detaljinformasjon om hvert enkelt objekt, samt muligheten for å aktivt markere landemerkene som besøkt om du befinner deg innenfor en viss radius.",
  "app.project-details.city-walk-in-gjoevik.section-3": "Mathis har her jobbet som fullstack utvikler med teknologier som Firebase (backend) og Ionic (frontend).",
  "app.project-details.noc-dashboard.section-1": "Mathis has siden 2018-19 jobbet med utvikling av et internt system for drift og overvåkning i Telenor. Systemet er driftskritisk og omfatter bruk av EKOM-sensitiv informasjon, og kan derfor ikke beskrives i detalj",
  "app.project-details.noc-dashboard.section-2": "NOC Dashboard består av en Tjenestekatalog, knyttet opp mot alarmer og feil, og kan vise status på alle Telenors tjenester live. Systemet håndterer flere ulike verdikjeder og presenterer ulike grensesnitt for alle disse.  Systemet inneholder også et dashboard som viser status på nett- og tjenester, samt avanserte analyser som knyttes opp mot Telenors KPI'er.",
  "app.project-details.noc-dashboard.section-3": "Mathis har gjennom arbeidet med NOC Dashboard utviklet en svært komplekse grensesnitt og administreringsmuligheter for Telenors tjenester. Han har hatt ansvaret for frontend utviklingen og har gjennom prosessen utviklet en dynamisk arbeidsmetodikk, skrevet vedlikeholdbar og oppdatert kode og forbedret Telenors evne til å utvikle bedre API'er.",
  "app.project-details.claims-web.section-1": "ClaimsWeb er et saksbehandling- og dokumentasjonssystem som brukes til fakturering av reparasjonsarbeid mot skadevolder som har ødelagt Telenors infrastruktur. Systemet er en kritisk del av Telenors feilrettingsprosess.",
  "app.project-details.claims-web.section-2": "Prosjektet Mathis har vært en del av har bidratt med innsikt i feilretting-prosessen i Telenor, evaluering av eksisterende løsning, rådgivning rundt endringer av plattform og implementering av ny en løsning. Arbeidet med løsningen omfatter databasearkitektur, eksponering av informasjon gjennom API-endepunkter og utvikling av en frontend-applikasjon for konsumering og presentering av denne informasjonen.",
  "app.project-details.claims-web.section-3": "Mathis har jobbet som fullstack utvikler og vært innom teknologier som .NET Core og Angular. Han har blant annet utviklet en dynamisk datatabell med en rekke konfigurasjonsmuligheter som reduserer tiden saksbehandlere trenger for å finne en aktuell sak. I tillegg har han utviklet flere funksjoner i grensesnittet for behandling, dokumentering og oppfølging av diverse saker. Gjennom hele prosjektet har Mathis jobbet tett med prosjekteier for å sikre at løsningen tilfredsstiller kravene som er satt til prosjektet på en best mulig måte.",
  "app.auth.login.username": "Brukernavn",
  "app.auth.login.password": "Passord"
}
